zophai-liu/rtk-zephyr/drivers/serial/uart_rtl8752h.c
/*
 * Copyright(c) 2020, Realtek Semiconductor Corporation.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT realtek_rtl8752h_uart

/**
 * @brief Driver for UART port on RTL8752H family processor.
 * @note  Please validate for newly added series.
 */

#include <zephyr/kernel.h>
#include <zephyr/arch/cpu.h>
#include <zephyr/sys/__assert.h>
#include <soc.h>
#include <zephyr/init.h>
#include <zephyr/linker/sections.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/clock_control/rtl8752h_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/irq.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/policy.h>

#ifdef CONFIG_UART_ASYNC_API
#include <zephyr/drivers/dma/dma_rtl8752h.h>
#include <zephyr/drivers/dma.h>
#include <rtl876x_gdma.h>
#endif

#include "uart_rtl8752h.h"
#include <rtl876x_uart.h>

#include <zephyr/logging/log.h>

#include <trace.h>
#define DBG_DIRECT_SHOW 0
LOG_MODULE_REGISTER(uart_rtl8752h, CONFIG_UART_LOG_LEVEL);

static const uint32_t RTL_UART_BAUDRATE_TABLE[][3] = {
	{271, 10, 0x24A}, /* 9600    */
	{150, 8, 0x3EF},  /* 19200   */
	{20, 12, 0x252},  /* 115200  */
	{11, 10, 0x3BB},  /* 230400  */
	{11, 9, 0x084},   /* 256000  */
	{7, 9, 0x3EF},    /* 384000  */
	{6, 9, 0x0AA},    /* 460800  */
	{3, 9, 0x0AA},    /* 921600  */
	{4, 5, 0},        /* 1000000 */
	{2, 5, 0},        /* 2000000 */
	{1, 8, 0x292},    /* 3000000 */
};

static uint32_t rtl_cfg2idx_baudrate(uint32_t baudrate)
{
	switch (baudrate) {
	case 9600:
		return 0;
	case 19200:
		return 1;
	case 115200:
		return 2;
	case 230400:
		return 3;
	case 256000:
		return 4;
	case 384000:
		return 5;
	case 460800:
		return 6;
	case 921600:
		return 7;
	case 1000000:
		return 8;
	case 2000000:
		return 9;
	case 3000000:
		return 10;

	default:
		return -ENOSYS;
	}
}

static uint16_t rtl_cfg2mac_data_bits(uint32_t data_bits)
{
	switch (data_bits) {
	case UART_CFG_DATA_BITS_7:
		return UART_WORD_LENGTH_7BIT;
	case UART_CFG_DATA_BITS_8:
		return UART_WORD_LENGTH_8BIT;
	default:
		return -ENOSYS;
	}
}

static int rtl_cfg2mac_stopbits(uint32_t stop_bits)
{
	switch (stop_bits) {
	case UART_CFG_STOP_BITS_1:
		return UART_STOP_BITS_1;
	case UART_CFG_STOP_BITS_2:
		return UART_STOP_BITS_2;
	default:
		return -ENOSYS;
	}
}

static uint16_t rtl_cfg2mac_parity(uint32_t parity)
{
	switch (parity) {
	case UART_CFG_PARITY_NONE:
		return UART_PARITY_NO_PARTY;
	case UART_CFG_PARITY_ODD:
		return UART_PARITY_ODD;
	case UART_CFG_PARITY_EVEN:
		return UART_PARITY_EVEN;
	default:
		return -ENOSYS;
	}
}

static int uart_rtl8752h_configure(const struct device *dev, const struct uart_config *cfg)
{
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;

	int baudrate_idx;
	int wordlen;
	int stopbits;
	int parity;

	baudrate_idx = rtl_cfg2idx_baudrate(cfg->baudrate);
	if (baudrate_idx < 0) {
		LOG_ERR("Unspported baudrate: %d", cfg->baudrate);
		return -ENOTSUP;
	}

	wordlen = rtl_cfg2mac_data_bits(cfg->data_bits);
	if (wordlen < 0) {
		LOG_ERR("Unspported data_bits: %d", cfg->data_bits);
		return -ENOTSUP;
	}

	stopbits = rtl_cfg2mac_stopbits(cfg->stop_bits);
	if (stopbits < 0) {
		LOG_ERR("Unspported stop_bits: %d", cfg->stop_bits);
		return -ENOTSUP;
	}

	parity = rtl_cfg2mac_parity(cfg->parity);
	if (parity < 0) {
		LOG_ERR("Unspported parity: %d", cfg->parity);
		return -ENOTSUP;
	}

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] baudrate_idx=%d, wordlen=%d, stopbits=%d, parity=%d, "
		   "hw_flow_ctrl=%d",
		   __func__, baudrate_idx, wordlen, stopbits, parity, config->hw_flow_ctrl);
#endif

	UART_InitTypeDef uart_init_struct;

	UART_StructInit(&uart_init_struct);
	uart_init_struct.UART_Div = RTL_UART_BAUDRATE_TABLE[baudrate_idx][0];
	uart_init_struct.UART_Ovsr = RTL_UART_BAUDRATE_TABLE[baudrate_idx][1];
	uart_init_struct.UART_OvsrAdj = RTL_UART_BAUDRATE_TABLE[baudrate_idx][2];
	uart_init_struct.UART_IdleTime = UART_RX_IDLE_1BYTE;
	uart_init_struct.UART_WordLen = wordlen;
	uart_init_struct.UART_StopBits = stopbits;
	uart_init_struct.UART_Parity = parity;
	uart_init_struct.UART_HardwareFlowControl = cfg->flow_ctrl;
	uart_init_struct.UART_RxThdLevel = 10;
	uart_init_struct.UART_TxThdLevel = UART_TX_FIFO_SIZE / 2;

#ifdef CONFIG_UART_ASYNC_API
	uart_init_struct.UART_DmaEn = UART_DMA_ENABLE;
#endif

	UART_Init(uart, &uart_init_struct);

#if DBG_DIRECT_SHOW
	for (uint32_t i = 0; i < 0x5c / 4; i++) {
		/* DBG_DIRECT("0x%x = 0x%x",((uint32_t *)uart+i),*((uint32_t *)uart+i)); */
	}
#endif
	data->uart_config = *cfg;
	return 0;
}

#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
static int uart_rtl8752h_config_get(const struct device *dev, struct uart_config *cfg)
{
	struct uart_rtl8752h_data *data = dev->data;

	*cfg = data->uart_config;

	return 0;
}
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */

static int uart_rtl8752h_poll_in(const struct device *dev, unsigned char *c)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;

	if (!UART_GetFlagStatus(uart, UART_FLAG_RX_DATA_AVA)) {
		return -1;
	}
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] c=%c", __func__, *c);
#endif

	*c = (unsigned char)UART_ReceiveByte(uart);

	return 0;
}

static void uart_rtl8752h_poll_out(const struct device *dev, unsigned char c)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;

	while (!(UART_GetTxFIFODataLen(uart) < UART_TX_FIFO_SIZE)) {
	}

#if DBG_DIRECT_SHOW
	/* DBG_DIRECT("[%s] uart=0x%x, c=%c", __func__, (uint32_t)uart, c); */
#endif

	UART_SendByte(uart, (uint8_t)c);
}

static int uart_rtl8752h_err_check(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;

	uint32_t err = 0U;

	if (UART_GetFlagStatus(uart, UART_FLAG_RX_OVERRUN)) {
		err |= UART_ERROR_OVERRUN;
	}

	if (UART_GetFlagStatus(uart, UART_FLAG_RX_PARITY_ERR)) {
		err |= UART_ERROR_PARITY;
	}

	if (UART_GetFlagStatus(uart, UART_FLAG_RX_FRAME_ERR)) {
		err |= UART_ERROR_FRAMING;
	}

	if (UART_GetFlagStatus(uart, UART_FLAG_RX_BREAK_ERR)) {
		err |= UART_BREAK;
	}

