zophai-liu/rtk-zephyr/drivers/serial/uart_rtl8752h.c
	return err;
}

#ifdef CONFIG_UART_INTERRUPT_DRIVEN

static int uart_rtl8752h_fifo_fill(const struct device *dev, const uint8_t *tx_data, int size)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
	uint8_t num_tx = 0U;
	unsigned int key;

	if (!UART_GetFlagStatus(uart, UART_FLAG_TX_EMPTY)) {
		return num_tx;
	}

	/* Lock interrupts to prevent nested interrupts or thread switch */

	key = irq_lock();

	while ((size - num_tx > 0) && UART_GetFlagStatus(uart, UART_FLAG_TX_EMPTY)) {
		UART_SendByte(uart, (uint8_t)tx_data[num_tx++]);
	}

	irq_unlock(key);

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] num_tx=%d", __func__, num_tx);
#endif
	return num_tx;
}

static int uart_rtl8752h_fifo_read(const struct device *dev, uint8_t *rx_data, const int size)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
	uint8_t num_rx = 0U;

	while ((size - num_rx > 0) && UART_GetFlagStatus(uart, UART_FLAG_RX_DATA_AVA)) {
		rx_data[num_rx++] = UART_ReceiveByte(uart);
	}

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] num_rx=%d", __func__, num_rx);
#endif
	return num_rx;
}

static void uart_rtl8752h_irq_tx_enable(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
	struct uart_rtl8752h_data *data = dev->data;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	data->tx_int_en = true;
	UART_INTConfig(uart, UART_INT_TX_FIFO_EMPTY, ENABLE);
}

static void uart_rtl8752h_irq_tx_disable(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
	struct uart_rtl8752h_data *data = dev->data;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	data->tx_int_en = false;
	UART_INTConfig(uart, UART_INT_TX_FIFO_EMPTY, DISABLE);
}

static int uart_rtl8752h_irq_tx_ready(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]" __func__);
#endif
	return UART_GetFlagStatus(uart, UART_FLAG_TX_EMPTY) && data->tx_int_en;
}

static int uart_rtl8752h_irq_tx_complete(const struct device *dev)
{
	return uart_rtl8752h_irq_tx_ready(dev);
}

static void uart_rtl8752h_irq_rx_enable(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
	struct uart_rtl8752h_data *data = dev->data;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	data->rx_int_en = true;
	UART_INTConfig(uart, UART_INT_RD_AVA, ENABLE);
}

static void uart_rtl8752h_irq_rx_disable(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
	struct uart_rtl8752h_data *data = dev->data;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	data->rx_int_en = false;
	UART_INTConfig(uart, UART_INT_RD_AVA, DISABLE);
}

static int uart_rtl8752h_irq_rx_ready(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	return UART_GetFlagStatus(uart, UART_FLAG_RX_DATA_AVA);
}

static void uart_rtl8752h_irq_err_enable(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	UART_INTConfig(uart, UART_INT_RX_LINE_STS, ENABLE);
}

static void uart_rtl8752h_irq_err_disable(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	UART_INTConfig(uart, UART_INT_RX_LINE_STS, DISABLE);
}

static int uart_rtl8752h_irq_is_pending(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	return ((UART_GetFlagStatus(uart, UART_FLAG_TX_EMPTY) && data->tx_int_en) ||
		(UART_GetFlagStatus(uart, UART_INT_RD_AVA) && data->rx_int_en));
}

static int uart_rtl8752h_irq_update(const struct device *dev)
{
	return 1;
}

static void uart_rtl8752h_irq_callback_set(const struct device *dev,
					   uart_irq_callback_user_data_t cb, void *cb_data)
{
	struct uart_rtl8752h_data *data = dev->data;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif

	data->user_cb = cb;
	data->user_data = cb_data;
}

#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

#ifdef CONFIG_UART_LINE_CTRL
int uart_rtl8752h_line_ctrl_set(const struct device *dev, uint32_t ctrl, uint32_t val)
{
	LOG_ERR("Unsupport line_ctrl_set function");
	return -ENOTSUP;
}

int uart_rtl8752h_line_ctrl_get(const struct device *dev, uint32_t ctrl, uint32_t *val)
{
	LOG_ERR("Unsupport line_ctrl_get function");
	return -ENOTSUP;
}
#endif

#ifdef CONFIG_UART_DRV_CMD
int uart_rtl8752h_drv_cmd(const struct device *dev, uint32_t cmd, uint32_t p)
{
	LOG_ERR("Unsupport drv_cmd function");
	return -ENOTSUP;
}
#endif
#ifdef CONFIG_UART_ASYNC_API
static inline void async_user_callback(struct uart_rtl8752h_data *data, struct uart_event *event)
{
	if (data->async_cb) {
		data->async_cb(data->dev, event, data->async_user_data);
	}
}

static inline void async_evt_rx_rdy(struct uart_rtl8752h_data *data)
{
	LOG_DBG("rx_rdy: (%d %d)", data->dma_rx.offset, data->dma_rx.counter);
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] data->dma_rx.counter=%d, data->dma_rx.offset=%d", __func__,
		   data->dma_rx.counter, data->dma_rx.offset);
#endif
	struct uart_event event = {.type = UART_RX_RDY,
				   .data.rx.buf = data->dma_rx.buffer,
				   .data.rx.len = data->dma_rx.counter - data->dma_rx.offset,
				   .data.rx.offset = data->dma_rx.offset};

	/* update the current pos for new data */
	data->dma_rx.offset = data->dma_rx.counter;

	/* send event only for new data */
	if (event.data.rx.len > 0) {
		async_user_callback(data, &event);
	}
}

static inline void async_evt_rx_err(struct uart_rtl8752h_data *data, int err_code)
{
	LOG_DBG("rx error: %d", err_code);

	struct uart_event event = {.type = UART_RX_STOPPED,
				   .data.rx_stop.reason = err_code,
				   .data.rx_stop.data.len = data->dma_rx.counter,
				   .data.rx_stop.data.offset = 0,
				   .data.rx_stop.data.buf = data->dma_rx.buffer};

	async_user_callback(data, &event);
}

static inline void async_evt_tx_done(struct uart_rtl8752h_data *data)
{
	LOG_DBG("tx done: %d", data->dma_tx.counter);

	struct uart_event event = {.type = UART_TX_DONE,
				   .data.tx.buf = data->dma_tx.buffer,
				   .data.tx.len = data->dma_tx.counter};

	/* Reset tx buffer */
	data->dma_tx.buffer_length = 0;
	data->dma_tx.counter = 0;

	async_user_callback(data, &event);
}

static inline void async_evt_tx_abort(struct uart_rtl8752h_data *data)
{
	LOG_DBG("tx abort: %d", data->dma_tx.counter);

