zophai-liu/rtk-zephyr/drivers/serial/uart_rtl8752h.c
	struct uart_event event = {.type = UART_TX_ABORTED,
				   .data.tx.buf = data->dma_tx.buffer,
				   .data.tx.len = data->dma_tx.counter};

	/* Reset tx buffer */
	data->dma_tx.buffer_length = 0;
	data->dma_tx.counter = 0;

	async_user_callback(data, &event);
}

static inline void async_evt_rx_buf_request(struct uart_rtl8752h_data *data)
{
	struct uart_event evt = {
		.type = UART_RX_BUF_REQUEST,
	};

	async_user_callback(data, &evt);
}

static inline void async_evt_rx_buf_release(struct uart_rtl8752h_data *data)
{
	struct uart_event evt = {
		.type = UART_RX_BUF_RELEASED,
		.data.rx_buf.buf = data->dma_rx.buffer,
	};

	async_user_callback(data, &evt);
}

static inline void async_timer_start(struct k_work_delayable *work, int32_t timeout)
{
	if ((timeout != SYS_FOREVER_US) && (timeout != 0)) {
		/* start timer */
		LOG_DBG("async timer started for %d us", timeout);
		k_work_reschedule(work, K_USEC(timeout));
	}
}

static void uart_rtl8752h_dma_rx_flush(const struct device *dev)
{
	struct dma_status stat;
	struct uart_rtl8752h_data *data = dev->data;

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]" __func__);
#endif

	if (dma_get_status(data->dma_rx.dma_dev, data->dma_rx.dma_channel, &stat) == 0) {
		size_t rx_rcv_len = data->dma_rx.buffer_length - stat.pending_length;
#if DBG_DIRECT_SHOW
		DBG_DIRECT("data->dma_rx.buffer_length=%d, stat.pending_length=%d, rx_rcv_len=%d, "
			   "data->dma_rx.offset=%d, rx fifo=%d",

			   data->dma_rx.buffer_length, stat.pending_length, rx_rcv_len,
			   data->dma_rx.offset,
			   UART_GetRxFIFOLen(((struct uart_rtl8752h_config *)(dev->config))->uart));
#endif
		if (rx_rcv_len > data->dma_rx.offset) {
			data->dma_rx.counter = rx_rcv_len;

			async_evt_rx_rdy(data);
		}
	}
}

static inline void uart_rtl8752h_dma_tx_enable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;

	uart->MISCR &= ~(0x1f << 3);
	uart->MISCR |= ((15) << 3) | BIT(1);
}

static inline void uart_rtl8752h_dma_tx_disable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;

	uart->MISCR &= ~BIT(1);
}

static inline void uart_rtl8752h_dma_rx_enable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;

	uart->MISCR &= ~(0x3f << 8);
	uart->MISCR |= ((1) << 8) | BIT(2);

	data->dma_rx.enabled = true;
}

static inline void uart_rtl8752h_dma_rx_disable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;

	uart->MISCR &= ~BIT(2);

	data->dma_rx.enabled = false;
}

void uart_rtl8752h_dma_tx_cb(const struct device *dma_dev, void *user_data, uint32_t channel,
			     int status)
{
	const struct device *uart_dev = user_data;
	struct uart_rtl8752h_data *data = uart_dev->data;
	struct dma_status stat;
	unsigned int key = irq_lock();

	/* Disable TX */
	uart_rtl8752h_dma_tx_disable(uart_dev);

	(void)k_work_cancel_delayable(&data->dma_tx.timeout_work);

	if (!dma_get_status(data->dma_tx.dma_dev, data->dma_tx.dma_channel, &stat)) {
		data->dma_tx.counter = data->dma_tx.buffer_length - stat.pending_length;
	}

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] channel=%d, status=%d, dma_tx.counter=%d", __func__, channel, status,
		   data->dma_tx.counter);
#endif

	data->dma_tx.buffer_length = 0;

	irq_unlock(key);

	dma_stop(data->dma_tx.dma_dev, data->dma_tx.dma_channel);

	/* Generate TX_DONE event when transmission is done */
	async_evt_tx_done(data);
}

static void uart_rtl8752h_dma_replace_buffer(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct device *uart_dev = dev;
	struct uart_rtl8752h_data *data = uart_dev->data;

	/* Replace the buffer and reload the DMA */
	LOG_DBG("Replacing RX buffer: %d", data->rx_next_buffer_len);

	/* reload DMA */
	data->dma_rx.offset = 0;
	data->dma_rx.counter = 0;
	data->dma_rx.buffer = data->rx_next_buffer;
	data->dma_rx.buffer_length = data->rx_next_buffer_len;
	data->dma_rx.blk_cfg.block_size = data->dma_rx.buffer_length;
	data->dma_rx.blk_cfg.dest_address = (uint32_t)(data->dma_rx.buffer);
	data->rx_next_buffer = NULL;
	data->rx_next_buffer_len = 0;

	dma_reload(data->dma_rx.dma_dev, data->dma_rx.dma_channel,
		   data->dma_rx.blk_cfg.source_address, data->dma_rx.blk_cfg.dest_address,
		   data->dma_rx.blk_cfg.block_size);

	dma_start(data->dma_rx.dma_dev, data->dma_rx.dma_channel);

	/* Request next buffer */
	async_evt_rx_buf_request(data);
}

void uart_rtl8752h_dma_rx_cb(const struct device *dma_dev, void *user_data, uint32_t channel,
			     int status)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] channel=%d, status=%d", __func__, channel, status);
#endif
	const struct device *uart_dev = user_data;
	struct uart_rtl8752h_data *data = uart_dev->data;

	if (status < 0) {
		async_evt_rx_err(data, status);
		return;
	}

	(void)k_work_cancel_delayable(&data->dma_rx.timeout_work);

	/* true since this functions occurs when buffer if full */
	data->dma_rx.counter = data->dma_rx.buffer_length;

	async_evt_rx_rdy(data);

	if (data->rx_next_buffer != NULL) {
#if DBG_DIRECT_SHOW
		DBG_DIRECT("[%s] channel=%d, status=%d, data->rx_next_buffer "
			   "!= NULL",
			   __func__, channel, status);
#endif
		async_evt_rx_buf_release(data);

		/* replace the buffer when the current
		 * is full and not the same as the next
		 * one.
		 */
		uart_rtl8752h_dma_replace_buffer(uart_dev);
	} else {
#if DBG_DIRECT_SHOW
		DBG_DIRECT("[%s] channel=%d, status=%d, data->rx_next_buffer "
			   "== NULL",
			   __func__, channel, status);
#endif

		k_work_reschedule(&data->dma_rx.timeout_work, K_TICKS(1));
	}
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] exit", __func__);
#endif
}

static int uart_rtl8752h_async_callback_set(const struct device *dev, uart_callback_t callback,
					    void *user_data)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct uart_rtl8752h_data *data = dev->data;

	data->async_cb = callback;
	data->async_user_data = user_data;

