zophai-liu/rtk-zephyr/drivers/serial/uart_rtl8752h.c
	return 0;
}

static int uart_rtl8752h_async_tx(const struct device *dev, const uint8_t *tx_data, size_t buf_size,
				  int32_t timeout)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] bufsize=%d, timeout=%d", __func__, buf_size, timeout);
#endif
	struct uart_rtl8752h_data *data = dev->data;
	int ret;

	if (data->dma_tx.dma_dev == NULL) {
		return -ENODEV;
	}

	if (data->dma_tx.buffer_length != 0) {
		return -EBUSY;
	}

	data->dma_tx.buffer = (uint8_t *)tx_data;
	data->dma_tx.buffer_length = buf_size;
	data->dma_tx.timeout = timeout;

	LOG_DBG("tx: l=%d", data->dma_tx.buffer_length);

	/* set source address */
	data->dma_tx.blk_cfg.source_address = (uint32_t)(data->dma_tx.buffer);
	data->dma_tx.blk_cfg.block_size = data->dma_tx.buffer_length;

	ret = dma_config(data->dma_tx.dma_dev, data->dma_tx.dma_channel, &data->dma_tx.dma_cfg);

	if (ret != 0) {
		LOG_ERR("dma tx config error!");
		return -EINVAL;
	}

	/* Start TX timer */
	async_timer_start(&data->dma_tx.timeout_work, data->dma_tx.timeout);

	/* Enable TX DMA requests */
	uart_rtl8752h_dma_tx_enable(dev);

	if (dma_start(data->dma_tx.dma_dev, data->dma_tx.dma_channel)) {
		LOG_ERR("UART err: TX DMA start failed!");
		return -EFAULT;
	}

	return 0;
}

static int uart_rtl8752h_async_tx_abort(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct uart_rtl8752h_data *data = dev->data;
	size_t tx_buffer_length = data->dma_tx.buffer_length;
	struct dma_status stat;

	if (tx_buffer_length == 0) {
		return -EFAULT;
	}

	(void)k_work_cancel_delayable(&data->dma_tx.timeout_work);

	dma_suspend(data->dma_tx.dma_dev, data->dma_tx.dma_channel);

	if (!dma_get_status(data->dma_tx.dma_dev, data->dma_tx.dma_channel, &stat)) {
		data->dma_tx.counter = tx_buffer_length - stat.pending_length;
	}

	dma_stop(data->dma_tx.dma_dev, data->dma_tx.dma_channel);
	async_evt_tx_abort(data);

	return 0;
}

static int uart_rtl8752h_async_rx_enable(const struct device *dev, uint8_t *rx_buf, size_t buf_size,
					 int32_t timeout)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] buf_size=%d, timeout=%d", __func__, buf_size, timeout);
#endif
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;
	int ret;
	uint32_t cnt = UART_GetRxFIFOLen(uart);

	for (uint32_t i = 0; i < cnt; i++) {
		UART_ReceiveByte(uart);
	}

	if (data->dma_rx.dma_dev == NULL) {
		return -ENODEV;
	}

	if (data->dma_rx.enabled) {
		LOG_WRN("RX was already enabled");
		return -EBUSY;
	}

	data->dma_rx.offset = 0;
	data->dma_rx.buffer = rx_buf;
	data->dma_rx.buffer_length = buf_size;
	data->dma_rx.counter = 0;
	data->dma_rx.timeout = timeout;

	/* Disable RX interrupts to let DMA to handle it */
	UART_INTConfig(uart, UART_INT_RD_AVA, DISABLE);

	data->dma_rx.blk_cfg.block_size = buf_size;
	data->dma_rx.blk_cfg.dest_address = (uint32_t)data->dma_rx.buffer;

	ret = dma_config(data->dma_rx.dma_dev, data->dma_rx.dma_channel, &data->dma_rx.dma_cfg);

	if (ret != 0) {
		LOG_ERR("UART ERR: RX DMA config failed!");
		return -EINVAL;
	}

	/* Enable RX DMA requests */
	uart_rtl8752h_dma_rx_enable(dev);

	/* Enable UART_INT_RX_IDLE to define the end of a
	 * RX DMA transaction.
	 */
	UART_INTConfig(uart, UART_INT_RX_IDLE, DISABLE);
	UART_INTConfig(uart, UART_INT_RX_IDLE, ENABLE);

	if (dma_start(data->dma_rx.dma_dev, data->dma_rx.dma_channel)) {
		LOG_ERR("UART ERR: RX DMA start failed!");
		return -EFAULT;
	}

	/* Request next buffer */
	async_evt_rx_buf_request(data);

	LOG_DBG("async rx enabled");

	return ret;
}

static int uart_rtl8752h_async_rx_buf_rsp(const struct device *dev, uint8_t *buf, size_t len)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] len=%d", __func__, len);
#endif
	struct uart_rtl8752h_data *data = dev->data;

	LOG_DBG("replace buffer (%d)", len);
	data->rx_next_buffer = buf;
	data->rx_next_buffer_len = len;

	return 0;
}

static int uart_rtl8752h_async_rx_disable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;
	struct uart_event disabled_event = {.type = UART_RX_DISABLED};

	if (!data->dma_rx.enabled) {
		async_user_callback(data, &disabled_event);
		return -EFAULT;
	}

	UART_INTConfig(uart, UART_INT_RX_IDLE, DISABLE);

	uart_rtl8752h_dma_rx_flush(dev);

	async_evt_rx_buf_release(data);

	dma_stop(data->dma_rx.dma_dev, data->dma_rx.dma_channel);

	uart_rtl8752h_dma_rx_disable(dev);

	(void)k_work_cancel_delayable(&data->dma_rx.timeout_work);

	if (data->rx_next_buffer) {
		struct uart_event rx_next_buf_release_evt = {
			.type = UART_RX_BUF_RELEASED,
			.data.rx_buf.buf = data->rx_next_buffer,
		};
		async_user_callback(data, &rx_next_buf_release_evt);
	}

	data->rx_next_buffer = NULL;
	data->rx_next_buffer_len = 0;

	/* When async rx is disabled, enable interruptible instance of uart to function normally */

	LOG_DBG("rx: disabled");

	async_user_callback(data, &disabled_event);

	return 0;
}

static void uart_rtl8752h_async_tx_timeout(struct k_work *work)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct uart_dma_stream *tx_stream =
		CONTAINER_OF(dwork, struct uart_dma_stream, timeout_work);
	struct uart_rtl8752h_data *data =
		CONTAINER_OF(tx_stream, struct uart_rtl8752h_data, dma_tx);
	const struct device *dev = data->dev;

	uart_rtl8752h_async_tx_abort(dev);

	LOG_DBG("tx: async timeout");
}

static void uart_rtl8752h_async_rx_timeout(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct uart_dma_stream *rx_stream =
		CONTAINER_OF(dwork, struct uart_dma_stream, timeout_work);
	struct uart_rtl8752h_data *data =
		CONTAINER_OF(rx_stream, struct uart_rtl8752h_data, dma_rx);
	const struct device *dev = data->dev;

	LOG_DBG("rx timeout");

#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] data->dma_rx.counter=%d, "
		   "data->dma_rx.buffer_length=%d",
		   __func__, data->dma_rx.counter, data->dma_rx.buffer_length);
#endif
	if (data->dma_rx.counter == data->dma_rx.buffer_length) {
		uart_rtl8752h_async_rx_disable(dev);
	} else {
		uart_rtl8752h_dma_rx_flush(dev);
	}
}

static int uart_rtl8752h_async_init(const struct device *dev)
{
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;

	data->dev = dev;

