zophai-liu/rtk-zephyr/drivers/serial/uart_rtl8752h.c
	if (data->dma_rx.dma_dev != NULL) {
		if (!device_is_ready(data->dma_rx.dma_dev)) {
			return -ENODEV;
		}
	}

	if (data->dma_tx.dma_dev != NULL) {
		if (!device_is_ready(data->dma_tx.dma_dev)) {
			return -ENODEV;
		}
	}

	/* Disable both TX and RX DMA requests */
	uart_rtl8752h_dma_rx_disable(dev);
	uart_rtl8752h_dma_tx_disable(dev);

	k_work_init_delayable(&data->dma_rx.timeout_work, uart_rtl8752h_async_rx_timeout);
	k_work_init_delayable(&data->dma_tx.timeout_work, uart_rtl8752h_async_tx_timeout);

	/* Configure dma rx config */
	memset(&data->dma_rx.blk_cfg, 0, sizeof(data->dma_rx.blk_cfg));

	data->dma_rx.blk_cfg.source_address = (uint32_t)(&(uart->RB_THR));

	data->dma_rx.blk_cfg.dest_address = 0; /* dest not ready */
	data->dma_rx.blk_cfg.source_addr_adj = data->dma_rx.src_addr_increment;
	data->dma_rx.blk_cfg.dest_addr_adj = data->dma_rx.dst_addr_increment;

	/* RX disable circular buffer */
	data->dma_rx.blk_cfg.source_reload_en = 0;
	data->dma_rx.blk_cfg.dest_reload_en = 0;

	data->dma_rx.dma_cfg.head_block = &data->dma_rx.blk_cfg;
	data->dma_rx.dma_cfg.user_data = (void *)dev;
	data->rx_next_buffer = NULL;
	data->rx_next_buffer_len = 0;

	/* Configure dma tx config */
	memset(&data->dma_tx.blk_cfg, 0, sizeof(data->dma_tx.blk_cfg));

	data->dma_tx.blk_cfg.dest_address = (uint32_t)(&(uart->RB_THR));

	data->dma_tx.blk_cfg.source_address = 0; /* not ready */

	data->dma_tx.blk_cfg.source_addr_adj = data->dma_tx.src_addr_increment;

	data->dma_tx.blk_cfg.dest_addr_adj = data->dma_tx.dst_addr_increment;

	data->dma_tx.dma_cfg.head_block = &data->dma_tx.blk_cfg;
	data->dma_tx.dma_cfg.user_data = (void *)dev;

	return 0;
}

#endif /* CONFIG_UART_ASYNC_API */

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)

static void uart_rtl8752h_isr(const struct device *dev)
{
	struct uart_rtl8752h_data *data = dev->data;
	const struct uart_rtl8752h_config *config = dev->config;
	UART_TypeDef *uart = config->uart;

	UART_GetIID(uart);
	if (data->user_cb) {
		data->user_cb(dev, data->user_data);
	}

#ifdef CONFIG_UART_ASYNC_API
	if (UART_GetFlagStatus(uart, UART_FLAG_RX_IDLE)) {
		LOG_DBG("idle interrupt occurred");
		if (data->dma_rx.timeout == 0) {
#if DBG_DIRECT_SHOW
			DBG_DIRECT("[%s] UART_FLAG_RX_IDLE timeout == 0", __func__);
#endif
			uart_rtl8752h_dma_rx_flush(dev);
		} else {
#if DBG_DIRECT_SHOW
			dma_suspend(data->dma_rx.dma_dev, data->dma_rx.dma_channel);
			DBG_DIRECT("[%s] dma len=%d", __func__,
				   GDMA_GetTransferLen((void *)(GDMA_CHANNEL_REG_BASE +
								data->dma_rx.dma_channel * 0x58)));
			dma_resume(data->dma_rx.dma_dev, data->dma_rx.dma_channel);
#endif

			/* Start the RX timer not null */
			UART_INTConfig(uart, UART_INT_RX_IDLE, DISABLE);
			UART_INTConfig(uart, UART_INT_RX_IDLE, ENABLE);
			async_timer_start(&data->dma_rx.timeout_work, data->dma_rx.timeout);
		}
	}

	/* Clear errors */
	uart_rtl8752h_err_check(dev);
#endif /* CONFIG_UART_ASYNC_API */
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s] exit", __func__);
#endif
}
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */

#ifdef CONFIG_PM_DEVICE
static int uart_rtl8752h_pm_action(const struct device *dev, enum pm_device_action action)
{
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	UART_TypeDef *uart = config->uart;
	int err;

	extern void UART_DLPSEnter(void *PeriReg, void *StoreBuf);
	extern void UART_DLPSExit(void *PeriReg, void *StoreBuf);

	switch (action) {
	case PM_DEVICE_ACTION_SUSPEND:

		UART_DLPSEnter(uart, &data->store_buf);

		/* Move pins to sleep state */
		err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_SLEEP);
		if ((err < 0) && (err != -ENOENT)) {
			return err;
		}
		break;
	case PM_DEVICE_ACTION_RESUME:
		/* Set pins to active state */
		err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
		if (err < 0) {
			return err;
		}

		UART_DLPSExit(uart, &data->store_buf);

		break;
	default:
		return -ENOTSUP;
	}

	return 0;
}
#endif /* CONFIG_PM_DEVICE */

static const struct uart_driver_api uart_rtl8752h_driver_api = {
	.poll_in = uart_rtl8752h_poll_in,
	.poll_out = uart_rtl8752h_poll_out,
	.err_check = uart_rtl8752h_err_check,
#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
	.configure = uart_rtl8752h_configure,
	.config_get = uart_rtl8752h_config_get,
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	.fifo_fill = uart_rtl8752h_fifo_fill,
	.fifo_read = uart_rtl8752h_fifo_read,
	.irq_tx_enable = uart_rtl8752h_irq_tx_enable,
	.irq_tx_disable = uart_rtl8752h_irq_tx_disable,
	.irq_tx_ready = uart_rtl8752h_irq_tx_ready,
	.irq_tx_complete = uart_rtl8752h_irq_tx_complete,
	.irq_rx_enable = uart_rtl8752h_irq_rx_enable,
	.irq_rx_disable = uart_rtl8752h_irq_rx_disable,
	.irq_rx_ready = uart_rtl8752h_irq_rx_ready,
	.irq_err_enable = uart_rtl8752h_irq_err_enable,
	.irq_err_disable = uart_rtl8752h_irq_err_disable,
	.irq_is_pending = uart_rtl8752h_irq_is_pending,
	.irq_update = uart_rtl8752h_irq_update,
	.irq_callback_set = uart_rtl8752h_irq_callback_set,
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

#ifdef CONFIG_UART_ASYNC_API
	.callback_set = uart_rtl8752h_async_callback_set,
	.tx = uart_rtl8752h_async_tx,
	.tx_abort = uart_rtl8752h_async_tx_abort,
	.rx_enable = uart_rtl8752h_async_rx_enable,
	.rx_buf_rsp = uart_rtl8752h_async_rx_buf_rsp,
	.rx_disable = uart_rtl8752h_async_rx_disable,
#endif /* CONFIG_UART_ASYNC_API */

#ifdef CONFIG_UART_LINE_CTRL
	.line_ctrl_set = uart_rtl8752h_line_ctrl_set,
	.line_ctrl_get = uart_rtl8752h_line_ctrl_get,
#endif

#ifdef CONFIG_UART_DRV_CMD
	.drv_cmd = uart_rtl8752h_drv_cmd,
#endif
};

/**
 * @brief Initialize UART channel
 *
 * This routine is called to reset the chip in a quiescent state.
 * It is assumed that this function is called only once per UART.
 *
 * @param dev UART device struct
 *
 * @return 0
 */
static int uart_rtl8752h_init(const struct device *dev)
{
	const struct uart_rtl8752h_config *config = dev->config;
	struct uart_rtl8752h_data *data = dev->data;
	int err;
#if DBG_DIRECT_SHOW
	DBG_DIRECT("[%s]", __func__);
#endif
	data->dev = dev;

	(void)clock_control_on(RTL8752H_CLOCK_CONTROLLER, (clock_control_subsys_t)&config->clkid);

	/* Configure pinmux  */

