zophai-liu/rtk-zephyr/drivers/serial/uart_rtl8752h.c
	err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (err < 0) {
		return err;
	}

	/* Configure peripheral  */

	err = uart_rtl8752h_configure(dev, &data->uart_config);
	if (err) {
		return err;
	}

	/* Enable nvic */
#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
	config->irq_config_func(dev);
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */

#ifdef CONFIG_UART_ASYNC_API
	return uart_rtl8752h_async_init(dev);
#else
	return 0;
#endif
}

#ifdef CONFIG_UART_ASYNC_API

#define UART_DMA_CHANNEL_INIT(index, dir)                                                          \
	.dma_dev = DEVICE_DT_GET(RTL8752H_DMA_CTLR(index, dir)),                                   \
	.dma_channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),                             \
	.dma_cfg =                                                                                 \
		{                                                                                  \
			.dma_slot = DT_INST_DMAS_CELL_BY_NAME(index, dir, slot),                   \
			.channel_direction = RTL8752H_DMA_CONFIG_DIRECTION(                        \
				RTL8752H_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.channel_priority = RTL8752H_DMA_CONFIG_PRIORITY(                          \
				RTL8752H_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.source_data_size = RTL8752H_DMA_CONFIG_SOURCE_DATA_SIZE(                  \
				RTL8752H_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.dest_data_size = RTL8752H_DMA_CONFIG_DESTINATION_DATA_SIZE(               \
				RTL8752H_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.source_burst_length = RTL8752H_DMA_CONFIG_SOURCE_MSIZE(                   \
				RTL8752H_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.dest_burst_length = RTL8752H_DMA_CONFIG_DESTINATION_MSIZE(                \
				RTL8752H_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.block_count = 1,                                                          \
			.dma_callback = uart_rtl8752h_dma_##dir##_cb,                              \
	},                                                                                         \
	.src_addr_increment =                                                                      \
		RTL8752H_DMA_CONFIG_SOURCE_ADDR_INC(RTL8752H_DMA_CHANNEL_CONFIG(index, dir)),      \
	.dst_addr_increment =                                                                      \
		RTL8752H_DMA_CONFIG_DESTINATION_ADDR_INC(RTL8752H_DMA_CHANNEL_CONFIG(index, dir)),

#endif

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
#define RTL8752H_UART_IRQ_HANDLER_DECL(index)                                                      \
	static void uart_rtl8752h_irq_config_func_##index(const struct device *dev);
#define RTL8752H_UART_IRQ_HANDLER(index)                                                           \
	static void uart_rtl8752h_irq_config_func_##index(const struct device *dev)                \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority), uart_rtl8752h_isr,  \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}
#else
#define RTL8752H_UART_IRQ_HANDLER_DECL(index) /* Not used */
#define RTL8752H_UART_IRQ_HANDLER(index)      /* Not used */
#endif

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
#define RTL8752H_UART_IRQ_HANDLER_FUNC(index)                                                      \
	.irq_config_func = uart_rtl8752h_irq_config_func_##index,
#else
#define RTL8752H_UART_IRQ_HANDLER_FUNC(index) /* Not used */
#endif

#ifdef CONFIG_UART_ASYNC_API
#define UART_DMA_CHANNEL(index, dir)                                                               \
	.dma_##dir = {COND_CODE_1(DT_INST_DMAS_HAS_NAME(index, dir),                               \
				  (UART_DMA_CHANNEL_INIT(index, dir)), (NULL))},
#else
#define UART_DMA_CHANNEL(index, dir)
#endif

#define RTL8752H_UART_INIT(index)                                                                  \
	RTL8752H_UART_IRQ_HANDLER_DECL(index)                                                      \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
                                                                                                   \
	static const struct uart_rtl8752h_config uart_rtl8752h_cfg_##index = {                     \
		.uart = (UART_TypeDef *)DT_INST_REG_ADDR(index),                                   \
		.clkid = DT_INST_CLOCKS_CELL(index, id),                                           \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                     \
		.hw_flow_ctrl = DT_INST_PROP_OR(index, flow_ctrl, false),                          \
		RTL8752H_UART_IRQ_HANDLER_FUNC(index)};                                            \
                                                                                                   \
	static struct uart_rtl8752h_data uart_rtl8752h_data_##index = {                            \
		.uart_config =                                                                     \
			{                                                                          \
				.baudrate = DT_INST_PROP(index, current_speed),                    \
				.parity =                                                          \
					DT_INST_ENUM_IDX_OR(index, parity, UART_CFG_PARITY_NONE),  \
				.stop_bits = DT_INST_ENUM_IDX_OR(index, stop_bits,                 \
								 UART_CFG_STOP_BITS_1),            \
				.data_bits = DT_INST_ENUM_IDX_OR(index, data_bits,                 \
								 UART_CFG_DATA_BITS_8),            \
				.flow_ctrl = DT_INST_PROP(index, hw_flow_control),                 \
			},                                                                         \
		UART_DMA_CHANNEL(index, rx) UART_DMA_CHANNEL(index, tx)};                          \
                                                                                                   \
	PM_DEVICE_DT_INST_DEFINE(index, uart_rtl8752h_pm_action);                                  \
	DEVICE_DT_INST_DEFINE(index, &uart_rtl8752h_init, PM_DEVICE_DT_INST_GET(index),            \
			      &uart_rtl8752h_data_##index, &uart_rtl8752h_cfg_##index,             \
			      PRE_KERNEL_1, CONFIG_SERIAL_INIT_PRIORITY,                           \
			      &uart_rtl8752h_driver_api);                                          \
                                                                                                   \
	RTL8752H_UART_IRQ_HANDLER(index)

DT_INST_FOREACH_STATUS_OKAY(RTL8752H_UART_INIT)
